class Questions {
  final String? quz;
  final String? answer;
  Questions({required this.quz, required this.answer});
}

// data questions
final List<Questions> quzData = [
  Questions(
      quz: ' بأي عامل ترتبط مسافة الأمن؟',
      answer:
          '\nتتعلق مسافة الأمن بالسرعة كلما زادت السرعة زادت مسافةالأمن\n حالةالطريق(جافةأو مبلة)وإذا كانت الطريق مبللة تكون مسافة الأمن أكبر'),
  Questions(
      quz: 'ماهي  الأخطار المتعلقة بالسياقة أثناء المطر الغزير؟',
      answer:
          'نقص الرؤية \nعدم التحكم في السيارة( توجيه السيارة يصبع خفيفا)\n مسافة الكبح تكون أطول\nعدم تشبث العجلات بالطريق( لايوجد إلتساق) الإنزلاق'),
  Questions(
      quz: 'أذكر 05 حالات للسحب الفوري لرخصة السياقة مع تعليق نافذ؟',
      answer:
          'قبل الوقوف أمام لجنة سحب رخص السياقة يتم تحرير محضر إثبات يدل على إجراء السحب الفوي لرخصة السياقة يبدأ سريانه خلال 48 ساعة بالنسبة لتاريخ الإثبات المدة القصوى لوقوف أونقل المركبة\n :الحالات هي\n إرتكاب جريمة القتل الخطأ أو الجرح نتيجة تهاون, تغافل أوعدم الإمتثال لقواعد حركة المرور\n إرتكاب جريمة القتل الخطأ والجرح في حالة سكر أو تحت تأثير أعشاب أو مواد تدخل ضمن أصناف المخدرات\n سياقة مركبة تحت تأثير دواء أو أعشاب تدخل ضمن أصناف المخدرات\n عند قيادة مركبة أو مرافقة سائق متدرب في إطار التمهين تحت تأثير مشروب كحولي يتميز بوجوده في الدم بنسبة تعادل أو تزيد عن 0.1 غ/1000\n رفض الخضوع لعملية التفتيش من طرف أعوان الأمن \n مخالفة الإجراءات المتعلقة بإشارات الأمر بالتوقف (الضوء الأحمر أوإشارة قف)'),
  Questions(
      quz: 'ما هي المناورات الممنوعة في الطريق السريع للسيارات ؟',
      answer:
          ':يمنع\n  الوقوف والتوقف\n  السير للخلف\n الدوران لاسيما عند عبور الشريط المركزي الفاصل بين الطريقين\n  الوقوف أو المكوث على الشريط المركزي\n كذلك تمنع مركبات نقل المسافرين أو البضائع التي يتجاوز طولها 7 م وحمولتها 2 طن من السير على  المسلك الأيسر إذا كانت الطريق تحتوي على 03 مسالك أو أكثر وفي اتجاه واحد\n تدريب المترشحين لرخص السياقة هذه القواعد لا تطبق على مركبات ذات الأولوية(م88 م ت04/381)'),
  Questions(
      quz: 'ماذا يمكن السياقة بالرخصة صنف"ب"؟',
      answer:
          'المركبات التي لا يتجاوذ وزنها الإجمالي مع الحمولة 3.5 طن\n عدد مقاعدها أقل من 09 مقاعد مع احتساب مقع السائق\n يمكن ربط مقطورة لا يتجاوز وزنها 750 كغ\n  لا يتجاوذ وزنها الإجمالي المرخص به مع الحمولة و المركبة الجارة فارغة\n لا يتجاوز مجموع الأوزان الإجمالية المرخص بها مع الحمولة للمجموعة (المركبة الجارة مع المقطورة) 3.5طن.(م180م ت04/381)'),
  Questions(
      quz: 'كيف تثبت حدود شريط التوقف الإستعجالي ؟هل يمكن عبور هذه الخطوط؟',
      answer:
          ' تثبت حدود شريط التوقف الإستعجالي بخطوط طولية متقطعة\n  لايمكن بأي حال من الأحوال إجتيازها، بحيت تخصص لحالات الإستعجال ولمركبات الأمن العمومي'),
  Questions(
      quz: 'ماهو الإلتصاق ؟ بماذا يتعلق؟',
      answer:
          '  الإلتصاق هو احتكاك العجلات بالأرض بحين تبقى المركبة على اتصال دائم مع الطريق ويكون الإلتصاق جيدا إذا هذا الإتصال قويا \n  يتعلق الإلتصاق ب:\n حالة الطريق جافة أو مبللة\n  حالة الأطر المطاطية\n  إهتزاز المركبة(La suspension)'),
  Questions(
      quz: 'ما هي فائدة مسافة الأمن؟',
      answer:
          'تجب الإصطدام في حالة التمهل المفاجئ أو التوقف المباغت للمركبة السابقة (م 20 م ت04/381 ) وكذلك تستغل في عملية التجاوز'),
  Questions(
      quz: 'ماهي أدوار مختلف أضواء المركبات ذات المحرك ؟ أذكرهم؟',
      answer:
          'أضواء تعمل على إضاءة الطريق وتساعد على الرؤية( أضواء الطريق وأضواء التقاطع)\n أضواء تعمل على تنبيه مستعملي الطريق بوجد مركبة (أضواء الوضعية، الأضواء الحمراء ، أضواء الضباب الخلفية ,وأضواء الموقف، وأضواء الكبح و faux Détresses)'),
  Questions(
      quz: ' كيف يجب أن يكون تصرف كل سائق في طريق ذو اتجاه واحد وبعدة مسالك؟',
      answer:
          'في حالة السير العادي على السائق إلتزام اليمين ويجب على السائقين أن يلتزموا الرتل الذي م فيه ولا يجوز لهم تغييره إلا استعدادا لتغيير الإتجا دون إعاقة السير العادي للمركبات الأخرى'),
  Questions(
      quz:
          'ما هي السرعة المحددة للطريق السريع للسيارآت (السيار)، في الطرق الأخرى،المناطق العمرانية؟',
      answer:
          'جافة مبللة\n  الطريق السريع 120 كلم/سا 100 كلم/ سا\n الطرق الأخرى 100 كلم/ سا 80 كلم/ سا\n المناطق العمرانية 50 كلم/ سا 40 كلم/ سا (م 24 م ت04/381)'),
  Questions(
      quz: 'أذكر 05 حالات لتخفيض السرعة؟',
      answer:
          ' لإقتراب من مفترق الطرق\n في  الأحوال الجوية الرديئة\n عندما تكون ظروف الرؤية غير كافية\n عندما لا يبدو الطريق فارغا\n  المنعرجات\n المنحدرات السريعة(م 23 م ت 04/381)'),
  Questions(
      quz: 'ما هي الأخطارالمتعلقة بضغط غير مناسب للأطر المطاطية ؟',
      answer:
          ':في حالة زيادة الضغط\n  نقص الإلتصاق\n خطر دوران العجلات دون تقدم السيارة لفقدان الإلتصاق\n خطر تمزق العجلات في حالة نقص الضغط\n  زيادة حرارة العجلات\n تصبح غير صالحة للإستعمال وفي وضع سيئ\n خطر إنفجار العجلات\n إستهلاك أكبر للوقود'),
  Questions(
      quz: 'ماهي نسبة الكحول المسموحة في الجزائر؟ كيف يمكن قياسها ؟',
      answer:
          ' يجب أن لا تزيد نسبة الكحول في الدم عن 0.1غ في الألف ويمكن قياسها بمقياس الكحول (ألكوتاست )أو مقياس( الإيثيل)'),
  Questions(
      quz: 'ذكر 03 حالات تؤدي للسحب الفوري لرخص السياقة دون تعليق نافذ؟',
      answer:
          '-عند التخفيض غير العادي للسرعة بدون أسباب حتمية من شأنه تقليص سيولة حركة المرور\n  عند مخالفة الإجراء المتعلق بشد حزام الأمن\n عدم ارتداء الخوذة بالنسبة لسائقي الدراجات النارية والراكبين\n عند الإستعمال اليدوي لجهاز الهاتف النقال أثناء سير المركبة\n  إرتداء خوذة التنصت الإذاعي والسمعي أثناء سير المركبة'),
  Questions(
      quz: 'ماهي حالات الأولوية لليمين؟',
      answer:
          'ملتقى الطرق بدون إشارات\n أمام الضوء الأصفر الغماز بدون إشارات أخرى\n أمام إشارة تقاطع طريقين ثانويين\n أمام إشارة تقاطع طريقين ثانويين خطيرين\n أمام إشارة تقاطع طريقين رئيسيين خطيرين\n أعمدة الأركان الأربعة'),
  Questions(
    quz:
        'ما هما القاعدتان الواجب إحترامهما في الطرق الجبلية أو الطرق ذات الإنحدارالكبير إذا تبين أن التلاقي صعب؟',
    answer:
        ' القاعدة الأولى: التوقف\n يجب على المركبة النازلة أن تتوقف هي الأولى في الوقت المناسب\n القاعدة الثانية:الرجوع للخلف اذا كان من المستحيل التلاقي دون أن تضطر إحدى المركبتين بالسير إلى الخلف يفرض وجوب هذا التراجع على \n  المركبات الخفيفة بالنسبة للمركبات الثقيلة\n الشاحنات بالنسبة للحافلات\n المركبات المنفردة بالنسبة لمجموع المركبات\n  إذا كانتا من نفس الصنف على المركبة النازلة الرجوع للخلف مالم يكن ذلك أسهل على المركبة الصاعدة (م 29 م ت 04/381) ',
  ),
  Questions(
      quz: 'ماهو الجهاز الذي يبين السائق الجديد؟',
      answer:
          'على كل سائق حائز على رخصة سياقة أقل م سنتين إلصاق إشارة 80 السرعة المحددة في الجهة الخلفية للسيارة ؛جهة السائق؛ ولا يمكن أن يتجاو السائق سرعة 80 كلم /سا لمدة عامين منذ الحصول على الرخصة(م25 م ت04/381)'),
  Questions(
      quz: 'ماذا تعني شهادة سياقة مؤقتة؟',
      answer:
          '-تمنح شهادة سياقة مؤقتة للمتحصل الجديد على رخصة السياقة والتي يخضع من خلالها إلى فترة تدريبية مدتها سنتين، وقد يتعرض صاحبها إلى سحب الرخصة في حالة ارتكابه للمخالفات المنصوص عليها قانونا( م 55 مكرر القانون 04.01)\n  جنحة الفرار \n  السياقة في حالة سكر\n  السير على الجسور ذات الوزن المحدد\n  تناول المهلوسات أو الأعشاب المخدرة\n  تجاوز السرعة المسموح بها والمحددة قانونا 40 كلم/ سا طريق سريع ، 30 كم/ سا خارج المناطق السكنية 20 كم /سا في المناطق السكنية)\n  إستعمال أجهزة مخصصة للتشويش على الرادارات'),
  Questions(
      quz: 'ماذا يؤدي عدم وضع حزام الأمن؟',
      answer:
          'يؤدي عدم وضع حزام الأمن إلى السحب الفوري لرخصة السياقة مع الإحتفاظ بالقدرة عل السياقة بعد وضع غرامة إلى غاية صدور قرارالجة الولائية المختصة بتعليق وسحب الرخص'),
  Questions(
      quz: 'إلى ماذا يؤدي السير على الشريط المخصص للوقوف الإستعجالي ؟',
      answer:
          ' يؤدي السير على الشريط المخصص للوقوف الإستعجالي إلى السحب الفوري لرخصة السياقة مع تعليق أوإلغاء القدرة على السياقة إلى غاية المثول أمام اللجنة الولائية المختصة بتعليق رخص السياقة وهذا بعد دفع غرامة طبعا'),
  Questions(
      quz: 'ماهو واجب السائق الذي وراءه سائق آخر يوشك أن يتجاوزه ؟',
      answer:
          ' على السائق أو السائقين أن يلتزموا أقص اليمين دون الزيادة في السرعة  (م 36 م ت381/ 04)'),
  Questions(
      quz:
          'ماهي مركبات الأولوية؟وما يجب على كل سائق أن يقوم به عندما تنبئ هذه المركبات باقترابها؟',
      answer:
          'المركبات ذات الأولوية هي المركبات التابة لمصالح الأمن والدرك الوطئي والجمارك\n عندما تنبئ مركبة ذات أولوية عن اقترابها يجب على كل مستعملي الطريق الآخرين أن يخفضوا سرعتهم ويتوقفوا عند الإقتضاء أو يوقفوا مركباتهم لتسهيل مرور تلك المركبة (م 02 مرسوم تنفيذي04/381)'),
  Questions(
      quz: 'ماهو الفرق بين الخطوط المتقطعة( العادية )والخطوط المتقطعة للتحذير؟',
      answer:
          ' الخطوط المقطعة العادية يمكن اجتيازها أما الخطوط المتقطعة لتحذير لا يكن اجتيازها لأنها تعلن عن الإقتراب من خط متواصل\n كذلك المسافة بين خط متقطع والخط الذي يليه 10م أما المسافة بين خط متقطع للتحذير والموالي له هي 1.33م'),
  Questions(
      quz: 'ماهو الهدف من الفحص التقني الدوري للمركبات؟',
      answer:
          'مراقبة حالة المركبة ومدى صلاحيتها للسير دون أن تشكل أية خطورة على الأمن المروري'),
  Questions(
      quz: 'ما هي الأخطار المتعلقة بالسياقة أثناء الليل ؟',
      answer:
          'الإنبهار بالأضواء للسائقين القادمين من الأمام والخلف\n إنعدام الإنارة للدرجات وبعض السائقين الآخرين\n تقدير سيء للمسافات والأحجام\n  إنعكاس أضواء السيارات على الطريق المبلل\n البخارعلى الزجاج يقلص من الرؤية\n الإنتقال من منطقة مضيئة إلى منطقة مظلمة\n الإنتقال من أضواء الطريق إلى أضواء التقاطع'),
  Questions(
      quz: 'ماهي المراحل الثلاثة المتعلقة بتغيير الإتجاه؟',
      answer:
          '-التأكد من أن المناورة لاتشكل خطرا على مستعملي الطريق(مراقبة المرآة الإرتدادية والعاكسة)\n إستعمال الضوء الغماز وإختيار الوضعية المناسبة على الطريق لعدم عرقلة المرور\n التخفيض من السرعة وإحترام الأولوية (رجال الأمن,الأضواء,الإشارات العمودية والأفقية)'),
  Questions(
      quz: 'أذكر 05 حالات متعلقة بالوقوف أو التوقف الخطير؟',
      answer:
          'المنعرجات وقمم المرتفعات\n الأنفاق\n الجسور\n قرب تقاطع الطرق\n أمام المؤسسات التعليمية والصحية (م 66م ق04/301)'),
  Questions(
      quz: 'من أي جهة تقوم بالتجاوز؟\nأذكر الحالات الإستشنائية؟',
      answer:
          'يتم التجاوز من اليسار( م 28 مرسوم ت 04/381)\n الإستثناءات: يرخص بتجاوز مركبة عن اليمين\n -عندما يشير سائقها أنه يتأهب لإنعطاف نحو اليسار\n -تجاوز مركبة تسير على سكة حديدية تعبر وسط الطريق عن اليمين عندما تكون المسافة الموجودة بين المركبة وجانب الطريق كافية(م31 م ت.04/381)\n ملاحظة:لا يعد سير مركبات رتل أسرع من مركبات الرتل الآخر في طريق ذو اتجاه واحد بمثابة تجاوز(م32 م ت 04/381) '),
  Questions(
      quz:
          'أذكر 04 حالات تؤدي إلى سحب رخصة السياقة تحت طائل إجراء المتابعة من قبل السيد الوالي؟',
      answer:
          'اجتياز ممر الراجلين قبل التأكد من خلوه من المارة\n مخالفة القوانين المتعلقة بالتقاطع والتجاوز \n مخالفة القوانين المتعلقة بالإزام والمنع المتعلق باجتياز سكة حديدية\n التغيير المفاجى للإتجاه دون التأكد أن العملية لا تشك خطرا على مستعملي الطريق الأخرين ودون انذارم بذلك مسبقا\n نقل الأطفال أقل من 10 سنوات في المقاعد الأمامية للسيارة\n عدم إلصاق إشارة تحديد السرعة القصوى 80 كلم/ سا في مؤخرة السيارة في حالة حيازتهم على رخصة السياقة منذ أقل من سنتين\n الزيادة في السرعة في حالة شروع سيارة أخرى في عملية التجاوز'),
  Questions(
      quz:
          'ماذا يجب على السائق أن يقوم به في حالة مكوث مركبته على الطريق السريع للسيارات؟',
      answer:
          'يجب على كل سائق يجد نفسه مضطرا لإيقاف مركبتة أن يجتهد لإيقافها خارج المسار المخصص للمرور، ويجب في جميع الحالات وضع إشارة لإعلان هذا التوقف الأضواء faux détresse ويتعين على السائق إذا لم يستطع ذلك ضرورة الإتصال بالجهات المعية قصد مساعدته(م 88 م ت 04/381)'),
  Questions(
      quz: 'متى يجب تجنب السياقة؟',
      answer:
          'يجب أن يتجب كل سائق السياقة عندما:\n يتعاطى مسكرا\n يكون تحت تأتير أية مادة من شأنها أن تؤثر في ردود أشغاله وقدراته في السياقة\n النعاس \n الإرهاق\n عندما تكون الرؤية غيركافية(م 18 ق14/01)'),
  Questions(
      quz: 'أذكر 05 حالات للتوقف أوالوقوف المعيق؟',
      answer:
          'أمام مرآب وموقف الحافلات\n أمام مداخل العمارات والبنايات داخل المؤسسات التعليمية ومداخل المؤسات التعليمية والصحية إذا كانت هذا المداخل قابلة لمرور السيارات\n في رتل مزدوج ماعدا الدراجات والدراجات النارية التي ليست لها عربة جانبية\n إذا تم هذا الوقوف في مسلك تعينه خصيصا السلطة المختصة بقرار توضع عليه قانونا إشارات\n عند مفترق الطرق وبالقرب من الإشارات الضوئية أو إشارات المرور، إذا كان وقوف السيارة يحجب الرؤية عن بقية المستعملين وبأي مكان يعرقل دخول أو خروح سيارة أخرى من وإلى الموقف'),
  Questions(
      quz: 'أذكر مختلف أنظمة الأولوية ؟',
      answer:
          'الأولوية لليمين\n  ترك الأولوية(Cedez le passage) \n الوقوف التام (Stop)\n الأولوية الخاصة (أمام إشارة طريق ذو حركة مرو كبيرة )تطبق فقط عند أول تقاطع نقابله، ونفقد الأولوية بعده\n طريق ذات أولوية الأولوية تبقى عند كل التقاطعات ما لم نواجه إشارة فقدان الأولوية\n التفاف دوراني( الأولوية للموجودين داخل الدائرة) '),
  Questions(
      quz: 'ماهو تصرف كل سائق يوجد في مسلك ذو سهم فردي أو مزدوج؟',
      answer:
          '(م16 م ت04/381)يجب على السائقين أن يتبعوا الإتجاه المبين أوأحد الإتجاهات المبينة على المسلك الذي يوجدون فيه '),
  Questions(
      quz:
          'إشرح إجراء السحب الفوري لرخصة السياقة مع تعليق نافذ؟ أذكر 05 حالات تؤدي لهذا الأمر؟',
      answer:
          'قبل الوقوف أمام لجنة سحب رخص السياقة يتم تحرير محضر إثبات يدل على إجراء السحب الفوري لرخصة السياقة يبدأ سريانه خلال48 سا بالنسبة لتاريخ الإثبات(المدة القصوى لنقل ووقوف المركبة)\n :الحالات\n السير على ممر التوقف الإستعجالي\n مخالفة القوانين المتعلقة بالإتجاهات الممنوعة(sens interdit ) \n عدم إحترام القوانين المتعلقة بنظام الأولوية\n القيام بالمناورات الممنوعة علي الطرق السريعة\n السياقة في حالة سكر أو تحت تأتير أعشاب مخدرة'),
  Questions(
      quz: 'ماهي الإحتياطات اللازمة لمتابعة مركبة أخرى في أحسن ظروف أمنية ؟',
      answer:
          'يجب على كل سائق يسير خلف مركبة أخرى أن يترك بينه وبين من سبقه مسافة أمن كافية بحيث يتجنب الإصطدام في حالة تمهل المركبة السابقة تمهل مفاجئا أو توقفها توقفا مباغتا، مع مراقبة أضواء التوقف( م 20 م.ت04/381)'),
  Questions(
      quz: 'كيف يجب الإقتراب من منعرج في أحسن ظروف أمنية ؟',
      answer:
          'لعمبور منعرج بشكل جيد وتجنب القوة المبعدة عن المركز(la face centrifuge)\n التقليل من السرعة قبل بلوغه\n تكييف السرعة حسب زاوية إنعطافه\n النظر إلى أبعد مدى ممكن\n الإحتفاظ بهامش من القوة للمناورة بحرية\n التزام اليمين\n التنبه بالإشارات عندما تكون الرؤية غير كافية'),
  Questions(
      quz: 'ماهي المراحل الثلاثة للتجاوز؟ إشرح المرحلة الأولى؟',
      answer:
          'يتم التجاوز من اليسار وعلى 08 مراحل:\n مرحلة الإستعداد للتجاوز\n مرحلة التجاوز\n مرحلة مابعد التجاوز والعودة إلى التيار العادي\n شرح المرحلة01: لإستعداد للتجاوز\n أن التجاوز مسموح( لا يوجد إشارة منع التجاوز)\n أنه يمكن التجاوز دون خطر على مستعملي الطريق\n السائق السابق واللاحق لم يعلنا عن التجاوز\n يمكن استرجاع مكانه ضمن التيار العادي للمرور\n أنه لا يعرقل حركة المرور في الإتجاه المعاكس\n استعمال الغماز الأيسر واستعمال المنبه الصوتي خارح المجمعات السكانية'),
  Questions(
      quz: 'ماهي المركبات التي ت تستفيد من تسهيل المرور؟',
      answer:
          'مركبات الحماية المدنية\n مصالح الغابات ومكافحة الحرائق\n سيارات الإسعاف والنقل الصحي\n تدخل الكهرباء والغاز\n صيانة الإتصالات السلكية واللاسلكية\n العربات المخصصة لنقل الأموال\n العربات المخصصة لنقل المساجين\n مركبات الأشغال العمومية (م 82 م.ت4/381)'),
  Questions(
      quz: 'داخل المناطق العمرانية ماهي وضعية كل مركبة في حالة وقوف ؟',
      answer:
          'يجب أن تكون كل مركبة في حالة توقف أو وقوف في التجمعات السكانية موافقة لاتجاه المرور حسب القواعد التالية:\nبالنسبة للطرق ذات الإتجاه المزدوج: على الجانب الأيمن من الطريق باستثناء أحكام مختلفة تتخذها السلطة المختصة\n بالنسبة للطرق ذات الإتجاه الواحد: على الجانب الأيمن أو الأيسر باستشاء أحكام مختلفة تتخذهاالسلطة المختصة\n في كل الحالات على: على الحافة إذا كانت غير مخصصة لمرور أصناف خاصة من المستعملين، وإذا كانت حالة الأرض تسمح بذلك(م60 م ت04/381)'),
  Questions(
      quz: 'كيف يجب أن تكون خصوصيات العناصر الأساسية المشتركة في أمن المرور؟',
      answer:
          'السائق: يجب على السائق احترام قانون المرور\n السيارة: يجب أن تكون السيارة في حالة جيدة صالحة للسير وتستجيب لكل متطلبات الأمن والراحة\n المحيط : لكي تكون عناصر الأمن متوفرة يجب أن يكون المحيط بما فيه حالة الطريق والأحوال الجوية بحالة جيدة وتوفر أماكن الراحة وتناسق الإشارات وتكاملها إلى غير ذلك من الأمور الضرورية الواجب توفرها في المحيط'),
  Questions(
      quz: 'ماهي الأخطار المتعلقة بالسياقة عند بداية المطر؟',
      answer:
          'تكون الطريق في بداية المطر زلجة لدرجة كبيرة(glissante)خصوصا إذا كانت في الأصل جافة وبالتالي فإن السائق معرض أكثر لاحتمال الإنزلاق وينقص الإلتصاق بدرجة كبيرة (في بداية المطر يمتزج الماء مع الزيت فيصعد الزيت فوق الماء ويصبح أكثر خطورة)'),
  Questions(
      quz: 'ما الفرق بين الوقوف والتوقف؟',
      answer:
          'التوقف: مكوث المركبة مؤقتا على الطريق طوال المدة اللازمة لركوب أشخاص أو نزولهم وشحن البضائع أوتفريغها مع بقاء السائق في مكان القيادة أو على مقربة منها ليتمكن عند الإقتضاء من تغيير مكانها ويكون المحرك مشتغلا دائما\n الوقوف: مكوث المركبة في الطريق خارج الظروف المميزة للتوقف ويكون المحرك صامتا(م 02 ق01/14)'),
  Questions(
      quz: 'ماهو تصرف كل سائق يقترب من ممر سكة حديدية غير محروس ؟',
      answer:
          'يتعين على كل سائق يقترب بممر سكة حديدية غير محروس أن يلتزم الحيطة والحذر و يجوز له أن يعمبره ما لم يتأكد من عدم اقتراب أي قطار( م 53 م ت 04/381)'),
  Questions(
      quz:
          'ما هي العمليتان المسبقتان التي يجب القيام بها من طرف كل سائق يستعد لتغيير ذي شأن في سرعة مركبته ؟',
      answer:
          'يجب على كل سائق يستعد للقيام بتغيير ذي شأن في سرعة مركبته أن:\n يتأكد مسبقا من أنه يستطيع القيام بذلك دون خطر\n يعلن نيته مسبقا بوقت كاف لمستعملي الطريق الأخرين (إشعال الضوء الغماز)(م17م ت04/381)'),
  Questions(
      quz:
          ' ماهي المراحل الثلاثة لمناورة تغيير الإتجاه؟ \n اشرح المرحلة الأولى والمرحلة الثالثة للدوران لليسار؟',
      answer:
          'التأكد من إمكانية القيام بتغيير الإتجاه دون خطر\n إشعال الضوء الغماز\n إذا توقفت فيجب أن تكون سيارتي في وضعية مناسب حسب الطريق الذي أسلكه\n شرح المرحلة01: إشعال الضوء الغماز وإبقائه مشتعلا لتمكين السائق اللاحق خلفي من الإدراك بأني سأدور إلى اليسار وبأنه يمكن أن يتجاوزني من جهة اليمين إذا كان الحيز كافيا\n شرح المرحلة02: في طريق ذو اتجاه واحد التزم أقصى اليسار \n في طريق ذو اتجاهين التزم جهة اليسار دون مجاوزة محور الوسط مع احترام أولوية المرور للقادمين من الإتجاه المعاكس\n في طريق يتضمن عدد فردي من المسالك : التزم المسلك الذي به سهم الإتجاه نحو اليسار'),
  Questions(
      quz: 'أذكر مختلف اللوحات الإضافية ؟',
      answer:
          'اللوحات الإضافية الخاصة بالمسافة\n اللوحات الإضافية الخاصة بالإمتداء\n اللوحات الإضافية الخاصة بالإتجاه والوضعية\n اللوحات الإضافية الخاصة بالصنف\n اللوحات الإضافية الخاصة بالوقوف التام\n اللوحات الإضافية المتممة لإشارات الوقوف والتوقف\n اللوحات الإضافية الخاصة بمخطط الطريق\n اللوحات الإضافية الخاصة يإشارات مختلفة\n (لوحات إضافية أخرى( مكتوبة) '),
  Questions(
      quz:
          'ماذا يعني الضوء الإضافي في كل سهم والذي يرافق نظام الأضواء الثلاثي ؟',
      answer:
          'يعني الضوء الإضافي في شكل سهم الذي يرافق نظام الأضواء الثلاثي أنه بإمكان السائق المتجه نفس اتجاه السهم اتباعه دون مراعاة الضوء الأحمر, ولكن بشرط عدم وجود سيارات قادمة من الإتجاهات الأخرى، ويكون ممر الراجلين خاليا'),
  Questions(
      quz: 'ماهو تصرف السائق عند لقاء إشارة الضوء الأحمر الثابت أو الغماز؟',
      answer:
          'يجب على كل سائق أن يتوقف تماما أمام إشارة الضوء الأحمر الثابت أو الغماز(م22 م ت04/381)'),
  Questions(
      quz:
          'ما هو تصرف السائق عندلقاء إشارة (انتباه وجود الأولاد)، (أماكن تستخدم من طرف الأطفال)؟',
      answer:
          'يجب على كل سائق عند ملاقاته هذه الإشارةأن يخفض من سرعته ويسير ببطء ويتوقف إن اقتضي الأمر ويبقى على يقظة وحذر تامين'),
  Questions(
      quz: 'ماهي صفة الخطوط التي تأتي قبل الخط المستمر؟',
      answer:
          'الخطوط التي تأتي قبل الخط المستمر هي خطوط متقطعة متقاربة وأسهم الإرتداد'),
  Questions(
      quz:
          'كيف يجب الإقتراب بكل أمن من منحدرات أو ارتفاعات ذات الإنحدارالكبير؟',
      answer:
          'التقليل من السرعة قبل الوصول إلى المنحدر\n أستعمل إلى أقصى درجة مكبح محركي بتخفيض سرعة السيارة من بداية المنحدر\n أضغط بالتاوب على المكبح من أجل ضبط السرعة\n عدم الكبح بصفة مستمرة\n ترك مسافة أمن كافية'),
  Questions(
      quz: 'كيف يمكن تفادي أي خطر حادث مرور ينجر عن غياب السائق؟',
      answer:
          'يجب أن لا نتكل على الكبح اليدوي، لأمن أكثر يجب تدوير العجلات واستعمال إحدى درجات السرعة ووضع حاجز أمام إحدى العجلات'),
  Questions(
      quz: 'ماهو تصرف كل سائق يقترب من مفترق طرق مزدحم؟',
      answer:
          'يجب عدم التقدم من مفترق طرق مزدحم إذا كنا نحتمل عدم استطاعته التحرك أو سد الحركة من الإتجاه المعاكس في نفس الوقت\n يمنع التوقف بسبب انسداد حركة المرور على مرر الراجلين'),
  Questions(
      quz:
          'ماذا يعني (الوزن الإجمالي للحمولة المرخص بها )في أي صنف نرتب المركبة التي يساوي وزنها الإجمالي للحمولة المرخص بها3.5  طن؟(م08ق01/14)',
      answer:
          'تصف المركبات التي يساوي وزنها الإجمالي الحمولة المرخص با 3.5 طن ضمن الصنف ب'),
  Questions(
      quz:
          'ماهي الإختلافات والتناظرات التي توجد بين الطريق السريع للسيارات والطريق السريع؟',
      answer:
          'التناظرات: يشتملان على اتجاهي حركة المرور على وسطي طريقين متميزين الاختلافات:\n الطريق السريع: يمكن أن تقطعه طرق أو سكك حديدية ، كما أنه قد يفصل بين إتجاهي حركة المرو شريط وسطي\n الطريق السريع مفتوح لكافة مستعملي الطريق\n السرعة المحددة على الطريق السريع120 كم\n الطريق السريع للسيارات: لا يقطعه طريق آخر أو سكة حديدية أو ممر للراجلين، ولا يمكن الدخول إليه إلا في نقطة مهيأة لذلك لا يؤدي إلى الممتلاكات المتاخمة ويفصل بين اتجاهي حركة المرور شريط أرضي وسطي غير مخصص للمرور( م 02 ق 01/14)'),
  Questions(
      quz: 'كيف يتم التوقف بالتعاقب ؟',
      answer:
          'التوقف بالتعاقب نصف الشهري ويتم حسب الشروط التالية\n يرخص بالتوقف بالتعاقب من 01 إلى 15 من الشهر في الجانب الذي تحمل فيه العمارات الأرقام الفردية\n يرخص من 16 إلى آخر الشهر في جانب الأرقام الزوجية\n يتم تغيير جانب التوقف في اليوم الأخير من كلا هاتين الفترتين ما بين الساعة الثامة والتاسعة ليلا (م67 م ت04/381) '),
  Questions(
      quz: 'ماهو تصرف كل سائق عند لقاء إشارات الخطر؟',
      answer:
          'يجب على كل سائق عند لقاء إشارات الخطر اليقظة التامة مع تخفيض السرعة\n تكييف السرعة حسب حالة الطريق'),
  Questions(
      quz: 'حسب أي ظروف يجب ضبط السرعة؟',
      answer:
          'تضبط السرعة حسب:\n صعوبات المرور وعوائقة\n حالة وسط الطريق\n الظروف الجوية'),
  Questions(
      quz: 'ماهي مختلف أجزاء الطريق؟',
      answer:
          'وسط الطريق:جزء من الطريق يستعمل لمرور المركبات\n الرصيف:جزء من طريق مخصص لمرور الراجلين\n الحافة:شريط أرضى يمتد من حدود الطريق إلى حدود قاعدة الطريق\n المسلك:أحد تفرعات وسط الطريق'),
  Questions(
      quz:
          'من من مستعملي الطريق لا يجوز له المرور عبر الطريق السريع للسيارات ؟',
      answer:
          'الراجلون\n الفرسان\n الدراجون\n الحيوانات\n المركبات ذات الجر الميكانيكي\n مركبات ذات الجر الميكانيكي غير خاضعة للترقيم\n المركبات التي تقوم بنقل استثنائي الجرارات والعتاد الفلاحي ومعدات الأشغال العمومية\n المركبات أو مجموع المركبات التي يمكها نظرا لصنفها بلوغ سرعة 60 كلم/سا في المنبسط (م81 م ق 04/381'),
  Questions(
      quz: 'ما هي الأضواء الخلفية الإجبارية لكل سيارة؟',
      answer:
          'أضواء قف ترى على بعد150 م\n   أضواء حمراء ترى على بعد 150 م \n  أضواء غمازة ترى على بعد 150 م\n أضواء عاكسة للنور ترى على بعد100 م\n ضوء لوحة الترقيم يرى ويقرأ على بعد 20 م'),
  Questions(
      quz: 'ماهي التزامات السائق نحو الراجلين؟',
      answer:
          'يلزم السائقين بالسماح بمرور الراجلين الموجودين في الممرات في حالة انعدام الإشارات الضوئية\n عند الاقتراب من الممرات المخصصة للراجلين يجب على السائق الإمتناع عن تجاوز السيارات دون التأكد من عدم وجود أحد الراجلين في هذا الممر (م38 ق 01/14)'),
  Questions(
      quz: 'ما هي أدنى حد للرؤية المطلوبة حسب الصنف؟',
      answer:
          'صنف أ - ب - و(الوزن الخفيف) F-B-A يجب أن لا يقل حد البصر12/20 \n صنف ج - د -ه (الوزن الثقيل) C-D-E يجب أنالا يقل حد البصر 16/20 \n قرار وزاري مشترك (15/11/84) يحدد قائمة الإصابات التي تتعارض والحصول على رخصة السياقة'),
  Questions(
      quz: 'ما هي الأضواء الثلاثة لنظام الأضواء الثلاثي وما معناها؟',
      answer:
          ':الأضواء الثلاثة هي \n الأحمر: ممنوع المرور\n الأخضر: مسموح المرور\n الأصفر :التنبيه لوقوف'),
  Questions(
      quz: 'ما هي الأصناف الثلاثة للوقوف؟',
      answer: 'الوقوف الموازي للرصيف\n الوقوف بشكل مائل\n  الوقوف المتعامد'),
  Questions(
      quz: 'أذكر مختلف (أصناف الإشارات العمودية)؟',
      answer:
          'إشارات الخطر\n إشارات المنع وإشارات نهاية المنع\n  إشارات الإرشاد\n  إشارات الاجبار'),
];
