import 'traffic.dart';

class Rule extends Traffic {
  Rule({required super.title, required super.imageUrl});
}

//data rules
final List<Rule> rilesData = [
  Rule(
      imageUrl: '$linkImag/333118483_599919028678870_6642556017477687117_n.jpg',
      title:
          'محور دوراني مع إشارة ترك المرور :تمر السيارة الحمراء ثم الصفراء'), //0
  Rule(
      imageUrl: '$linkImag/333869592_160174906887742_26601016974782352_n.jpg',
      title:
          'تقاطع طرق مع إشارة قف على 150 متر إشارة قف:تمر السيارتان الزرقاء و الصفراء في نفس الوقت ثم تمر السيارة الحمراء'),
  Rule(
      imageUrl: '$linkImag/334191800_724049202534174_3644334994470827508_n.jpg',
      title:
          'تقاطع طرق مع إشارة تقاطع طرق الأولوية لليمين:تمر السيارة الزرقاء ثم الحمراء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/332926176_604440328200224_4366417947740484714_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية وسهم الاتجاه:تمر السيارة الصفراء و الرجل في نفس الوقت, ثم تمر السيارة الزرقاء أما السيارة الحمراء فتنتظر الضوء الأخضر '),
  Rule(
      imageUrl: '$linkImag/332873654_168762009348022_6022085967748719395_n.jpg',
      title:
          'تقاطع طرق مع إشارة  طريق رئيسي يقطعه طريق ثانوي ، الأولوية للطريق الرئيسي :تمر السيارتان الحمراء والزرقاء ثم تمر السيارة الصفراء'),
  Rule(
      imageUrl: '$linkImag/334541669_918213909220023_3914828459721393770_n.jpg',
      title:
          'تقاطع الطرق مع إشارة ضوئية :تمر السيارة الحمراء ،أما السياراتان الصفراء والزرقاء فتنتظران الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/332963100_562764725635619_7674747365900581263_n.jpg',
      title:
          'تقاطع طرق بدون إشارة، الأولوية لليمين : تمر السيارة الصفراء ثم الحمراء ثم الزرقاء'),
  Rule(
      imageUrl: '$linkImag/332914768_885590469393936_8211566196654242952_n.jpg',
      title:
          'السيارة الخضراء تستطيع تجاوز السيارة الحمراء أما السيارة الصفراء فلا تستطيع التجاوز  إلى المسار الثالث  ولا يمكنها متابعة السيارة  الخضراء ، عليها الرجوع إلى اليمين'),
  Rule(
      imageUrl:
          '$linkImag/332932077_2037474859930730_9050545791720078251_n.jpg',
      title:
          'تقاطع طرق مع إشارة حذار محور دوراني وإشارة ترك المرور : تمر السيارة الزرقاء ثم البيضاء'),
  Rule(
      imageUrl:
          '$linkImag/332906947_3401945643381537_1232861987458281630_n.jpg',
      title:
          'تقاطع طرق مع إشارة حذار محور دوراني و إشارة ترك المرور : تمر السيارتان الخضراء و الصفراء في نفس الوقت، ثم تمر الحمراء'),
  Rule(
      imageUrl: '$linkImag/333954256_724287802531309_7203480317799931726_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية، تمر السيارتان الصفراء و الزرقاء، ثم تمر الحمراء'),
  Rule(
      imageUrl: '$linkImag/333114359_188215483919761_6860266716346637296_n.jpg',
      title:
          'تقاطع طرق مع إشارة ترك المرور : تمر السيارتان الزرقاء و الصفراء ، ثم الحمراء'),
  Rule(
      imageUrl: '$linkImag/332849593_960292045337763_8595129844936149810_n.jpg',
      title:
          'تقاطع الطرق مع إشارة ترك المرور : تمر السيارتان الحمراء و الزرقاء ، ثم السيارة الصفراء'),
  Rule(
      imageUrl: '$linkImag/334059609_881919286440393_7700059099448060443_n.jpg',
      title:
          'تقاطع طرق مع إشارة نهاية طريق ذات الأولوية على بعد 400 م وإشارة تقاطع طرق ، الأولوية  إلى اليمين : تمر السيارة الزرقاء ثم الصفراء ثم الحمراء'),
  Rule(
      imageUrl: '$linkImag/333036282_210033641703759_773463175780067688_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية : السيارة الصفراء تستطيع المرور، أما الحمراء والزرقاء فتنتظران الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/334088819_597790612211427_4420000727192291841_n.jpg',
      title:
          'المركبة الزرقاء لا يمكنها التجاوز  بسب وجود الخط المستمر  على يسارها قبل الخط المتقطع'),
  Rule(
      imageUrl: '$linkImag/333869607_903612424094205_8396321791633853475_n.jpg',
      title:
          'تقاطع طرق مع إشارة تقاطع طرق (الأولوية لليمين) :  تمر السيارة الزرقاء  ثم الحمراء'),
  Rule(
      imageUrl:
          '$linkImag/332935915_1881895975498264_3972274369459436713_n.jpg',
      title:
          'تقاطع طرق مع إشارة  طريق رئيسية تقطعها طريق فرعية (الأولوية للطرق الرئيسية ) : تمر السيارتان الزرقاء و الحمراء، ثم تمر السيارة الصفراء'),
  Rule(
      imageUrl: '$linkImag/332924255_648402090627533_2697855000761613415_n.jpg',
      title:
          'تقاطع طرق مع إشارة ترك المرور : تمر السيارة الصفراء ثم الزرقاء (السائر قبل الدائر) ثم تمر السيارة الحمراء'),
  Rule(
      imageUrl: '$linkImag/333599143_914643846347154_7735499278879674492_n.jpg',
      title:
          'تقاطع الطرق مع إشارة قف :  مكان علامة إستفهام تكون إشارة قف "قف على 150 م"'),
  Rule(
      imageUrl: '$linkImag/332896291_221057497122652_6516214002410878866_n.jpg',
      title:
          'تقاطع طرق مع إشارة حذار تقاطع طرق خطير (الأولوية لليمين) : تمر السيارة الصفراء ثم الحمراء ثم الزرقاء'),
  Rule(
      imageUrl: '$linkImag/333292002_226285403229587_7148399750185706807_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية : السيارة الحمراء تستطيع المرور، أما السيارتان الزرقاء و الصفراء فتنتظران الضوء الأحمر'),
  Rule(
      imageUrl: '$linkImag/332663711_884969639460314_1027299371081382642_n.jpg',
      title:
          'تقاطع طرق بدون إشارة، الأولوية لليمين : تمر السيارة الزرقاء ثم الحمراء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/332944031_1237987570456341_191361222977801170_n.jpg',
      title:
          'تقاطع طرق مع إشارة قف على 150 متر و إشارة قف عند التقاطع :  تمر السيارة الزرقاء ثم الصفراء ( السائر قبل الدائر ) ثم تمر السيارة الحمراء'),
  Rule(
      imageUrl: '$linkImag/333067352_908977890155559_6889142064124281652_n.jpg',
      title:
          'تقاطع الطرق مع إشارة طريق ذات أولوية أو إشارة ترك المرور :  تمر السيارة الحمراء ثم الزرقاء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/332877118_577996700941561_4456568706828497998_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية وإشارة طريق ذات أولوية وإشارة ترك المرور، نتبع الأضواء : تمر السيرات الصفراوتان والزرقاء، أما الحمراء فتنتظر الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/333166168_228807372864859_4629719489824327810_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق رئيسي  يقطعه طريق ثانوي : الإشارة الناقصة هي ترك المرور (لأن الخطوط على الطريق متقطعة )'),
  Rule(
      imageUrl: '$linkImag/333702431_684730333425897_5938668911298391683_n.jpg',
      title:
          'تقاطع طريق حذار محور  دوراني  مع إشارة ترك المرور : تمر السيارة الحمراء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/332932052_920171815975641_7412805280184518119_n.jpg',
      title:
          'تقاطع طريق بدون إشارة (الأولوية لليمين) : تمر السيارة الزرقاء ثم الصفراء ثم الحمراء'),
  Rule(
      imageUrl:
          '$linkImag/334431530_1416034819164659_7717215513556977183_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية و سهم الإتجاه : تمر السيارة الصفراء  و الرجل في نفس الوقت، ثم تمر السيارة الزرقاء أما السيارة الحمراء فتنتظر الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/332889565_784297992568917_7326646020410445013_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية : تمر السيارة الزرقاء ، أما السياراتان  الصفراء و الخضراء فتنتظران الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/332873654_232626999167816_8666569846849576262_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية و أسهم الإتجاه : تمر السيارتان الزرقاء  و الخضراء ، أما الصفراء و الحمراء فتنتظران الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/333267660_982352392753281_315751924275308830_n.jpg',
      title:
          'تقاطع طرق مع إشارة حذار تقاطع طرق (الأولوية لليمين) : تمر السيارة الحمراء ، ثم الزرقاء والتي وراءها ثم تمر السيارة الصفراء'),
  Rule(
      imageUrl:
          '$linkImag/332972256_1196793234346012_5459863568878422168_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق رئيسي يقطعه طريق ثانوي ، وإشارة ترك المرور : تمر السيارتان الزرقاء و الصفراء ثم تمر السيارتان الحمراء والتي وراءها'),
  Rule(
      imageUrl:
          '$linkImag/333136341_1423933171681768_4056185547793238107_n.jpg',
      title:
          'تقاطع طرق مع إشارة ترك المرور : الإشارة الناقصة  ترك المرور على بعد 150 متر'),
  Rule(
      imageUrl:
          '$linkImag/331258626_1133097320694631_5132684061746168492_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية : تمر السيارتان الحمراء و الصفراء ، أما السيارتان البيضاء و الزرقاء فتنتظران الضوء الأخضر'),
  Rule(
      imageUrl:
          '$linkImag/333184490_3157613364536841_8035870828602833904_n.jpg',
      title:
          'تقاطع طرق بدون إشارة (الأولوية لليمين ) : تمر السيارة الصفراء ثم السيارتان الزرقاوان ثم تمر السيارة الحمراء'),
  Rule(
      imageUrl: '$linkImag/334592805_689350686274040_6920912828000902580_n.jpg',
      title:
          'تقاطع طرق مع إشارة نهاية طريق ذات أولوية على بعد 200 متر وإشارة قف على بعد 150 متر  و إشارة وقف ومعالم تقاطع طرق : تمر السيارتان الحمراء والزرقاء ثم تمر السيارة الصفراء'),
  Rule(
      imageUrl:
          '$linkImag/332999678_3480770472245163_9055761896836734060_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية و إشارة قف : تمر السيارتان الصفراء و الحمراء ثم تمر السيارتان الزرقاء و البيضاء'),
  Rule(
      imageUrl:
          '$linkImag/333283899_1364281114358111_4563600739684007929_n.jpg',
      title:
          'تقاطع طرق مع إشارة قف على 150 متر و إشارة قف : تمر السيارتان الحمراء و الصفراء ثم تمر السيارة الزرقاء'),
  Rule(
      imageUrl: '$linkImag/333971432_731027168508549_3186296573899718527_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية و إشارة ترك المرور على بعد 150 متر و إشارة ترك المرور : تمر السيارتان الحمراوتان و السيارة الصفراء ثم السيارة الزرقاء'),
  Rule(
      imageUrl: '$linkImag/332903328_740723461105534_9147196850909441971_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية : تمر السيارة الزرقاء و السيارتان الصفراوتان ، أما السيارة الحمراء فتنتظر الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/333204877_220444697156174_6318219129187585359_n.jpg',
      title:
          'تقاطع طرق مع إشارة نهاية أولوية الطريق على بعد 400 متر وإشارة ترك المرور : السيارة الحمراء تمر أولا'),
  Rule(
      imageUrl: '$linkImag/333608619_779553487218408_5131813529428824211_n.jpg',
      title:
          'تقاطع طرق مع إشارة ترك المرور  على 150 متر وإشارة ترك المرور : الإشارة الناقصة هي إشارة طريق ذات أولوية أو طريق رئيسي يقطعه طريق ثانوي'),
  Rule(
      imageUrl: '$linkImag/333788703_878734143388618_7563645372465493600_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية (4 أضواء صفراء غمازة ) وإشارات طريق ذات أولوية (بإتجاه اليمين ) وإشارة ترك المرور ،نتبع الإشارات : تمر  السيارة الحمراء ثم الزرقاء ثم الخضراء'),
  Rule(
      imageUrl: '$linkImag/333108127_595931302121045_3999570957978113780_n.jpg',
      title:
          'تقاطع طرق مع إشارة ترك المرور وإشارة محور دوراني : تمر السيارة  الحمراء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/333267660_598386991856714_6588469387897791399_n.jpg',
      title: 'السيارة الزرقاء تستطيع التجاوز : لأن الخط على يسارها متقطع'),
  Rule(
      imageUrl:
          '$linkImag/332837897_1127284107945905_1114279594462998964_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية و إشارات أخرى و الشرطي : تمر السيارتان الصفراء و الخضراء أما السياراتان الزرقاء و الحمراء فتنتظران إشارة الشرطي'),
  Rule(
      imageUrl: '$linkImag/333045923_878721743213133_6298971640600546901_n.jpg',
      title:
          'تقاطع طرق مع ترك المرور : تمر السيارة الحمراء ثم تمر السيارة الصفراء'),
  Rule(
      imageUrl: '$linkImag/333674930_506372134826237_3418798640984171792_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق رئيسي يقطعه طريق ثانوي و إشارة قف : تمر السيارتان الصفراء و الخضراء ثم تمر السيارتان الزرقاء و الحمراء'),
  Rule(
      imageUrl: '$linkImag/333524689_712277054011173_4924718358666873304_n.jpg',
      title:
          'تقاطع طرق مع إشارة تقاطع طرق خطير (الأولوية لليمين ) : تمر الشاحنة و السيارة الخضراء ثم السيارة الحمراء وبعدها الدراجة'),
  Rule(
      imageUrl: '$linkImag/333903985_684048880187802_3886438772201071383_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية و سهم السماح بالدوران : تمر السيارتان البيضاء و الصفراء، بعدها  يمكن للسيارة الزرقاء الدوران إلى اليمين أما السيارة الحمراء فتنتظر الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/333109426_577531734405339_4590681511987150423_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية و الشرطي، نتبع وضعية الشرطي : تمر  السيارتان الزرقاء و الخضراء ، أما الصفراء و الحمراء فتنتظران إشارة الشرطي'),
  Rule(
      imageUrl: '$linkImag/334056091_121555857541820_334320276427898356_n.jpg',
      title: 'السيارة الزرقاء تستطيع التجاوز : لأن الخط المتقطع محاذ لها'),
  Rule(
      imageUrl: '$linkImag/333034489_216698087695851_649343716821029005_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية وإشارات أخرى، نتبع الإشارة الضوئية : تمر السيارتان الحمراء و الصفراء ، أما السيارة الزرقاء فتنتظر الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/334307565_921781225512333_5502800884868986248_n.jpg',
      title:
          'تقاطع طرق بدون إشارة (الأولوية لليمين) :تمر السيرتان الحمراء والتي وراءها ثم الصفراء ثم الزرقاء'),
  Rule(
      imageUrl:
          '$linkImag/333067963_5963559907067724_5833457714283007137_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية وإشارة قف على بعد 150 متر و إشارة قف عند التقاطع : تمر السيارة الزرقاء ثم الصفراء'),
  Rule(
      imageUrl:
          '$linkImag/334058148_1352480262197134_4450853455949367890_n.jpg',
      title:
          'تقاطع طرق مع إشارة حذار تقاطع طرق (الأولوية لليمين ) : تمر السيارتان الصفراء الثلاث ثم تمر السيارة الزرقاء وأخيرا تمر السيارة الحمراء'),
  Rule(
      imageUrl: '$linkImag/333051747_529957572549194_9205482053581350594_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية ، وإشارة نهاية أولوية الطريق على بعد 300 متر وإشارة ترك المرور على بعد 150 متر و إشارة ترك المرور عند التقاطع : تمر السيارة الزرقاء ثم الحمراء'),
  Rule(
      imageUrl: '$linkImag/333106006_636387664962999_7743816747216013788_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق رئيسي يقطعه طريق ثانوي وإشارة ترك المرور على 150 متر و إشارة ترك المرور : تمر السيارة الحمراء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/333274707_3459846060917471_750144971658174000_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية ،وإشارة نهاية طريق ذات أولوية على 300 متر وإشارة قف على 150 متر و إشارة قف :تمر السيارتان الحمراء والزرقاء ثم تمر السيارة الصفراء'),
  Rule(
      imageUrl: '$linkImag/333789649_248255584330424_8760782441755837485_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية وإشارة قف على بعد 150 متر و إشارة قف : تمر السيارة الزرقاء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/333019851_751626266677566_6523590364050601081_n.jpg',
      title:
          'السيارة الزرقاء (التي تجر المقطورة) تتوقف لتفسح الطريق للسيارة الحمراء (خارج المدينة)'),
  Rule(
      imageUrl: '$linkImag/333898984_897231978059633_7268397417451036394_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذو إتجاه واحد : السيارة ليست في وضعية صحيحة للدوران إلى اليسار، لأنها في طريق ذو إتجاه واحد (يجب إلتزام أقصى اليسار)'),
  Rule(
      imageUrl:
          '$linkImag/333038168_1437996510356005_7870116105265938766_n.jpg',
      title:
          '$linkImag/طريق جبلي ضيق : السيارة التي تجر مقطورة تتوقف لتفسح الطريق الحمراء'),
  Rule(
      imageUrl: '$linkImag/333698353_234058159064570_5839393629908245816_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذو إتجاه واحد : المركبة في وضعية صحيحة للدوران إلى اليسار'),
  Rule(
      imageUrl: '$linkImag/333442057_767216151493388_3067329300969899381_n.jpg',
      title: 'طريق جبلي ضيق : الحافلة تتوقف لتفسح الطريق للسيارة الحمراء'),
  Rule(
      imageUrl: '$linkImag/333201958_604076418292447_7877824974826507543_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية و : السيارة الزرقاء إذا كانت قريبة تمر و إذا كانت بعيدة تنتظر الضوء الاخضر، و السيارتان الحمراء و الصفراء تنتظران الضوء الأخضر'),
  Rule(
      imageUrl: '$linkImag/332994028_506001291535888_2814817607730189708_n.jpg',
      title:
          'تقاطع طرق مع إشارة تقاطع طرق (الأولوية لليمين ) :  الإشارة الناقصة هي نفس إشارة( حذار، تقاطع طرق)'),
  Rule(
      imageUrl: '$linkImag/333635340_935732797424254_7673027702558783608_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية : الإشارة الناقصة هي إشارة قف'),
  Rule(
      imageUrl:
          '$linkImag/333295722_2160305004175834_6198880163875108038_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية و إشارة ترك المرور : تمر السيارة الصفراء ثم تمر السيارتان الزرقاء و الحمراء'),
  Rule(
      imageUrl:
          '$linkImag/333571146_2166823243503975_6146493072890306248_n.jpg',
      title:
          'تقاطع طرق مع إشارة تقاطع طريق (الأولوية لليمين ) : تمر السيارة الحمراء ثم الزرقاء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/333435158_753744466322142_4054005211914095947_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية (4 أضواء صفراء غمازة ) ،مع إشارة طريق ذات أولوية ،وإشارة ترك المرور ، نعمل بالإشارات : تمر السيارتان الخضراء و الزرقاء ثم تمر الحمراء'),
  Rule(
      imageUrl: '$linkImag/333596610_219305627323570_8535945115337512726_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق رئيسي يقطعه طريق ثانوي وإشارة ترك المرور : تمر السيارة الصفراء ثم تدور السيارة الخضراء بعدها تمر السيارتان الزرقاء و الحمراء'),
  Rule(
      imageUrl:
          '$linkImag/333564983_1560122524485458_3405619177346402873_n.jpg',
      title:
          'تقاطع طرق مع إشارة طريق ذات أولوية و إشارة ترك المرور : تمر السيارة الصفراء ثم السيارتان الزرقاء و الحمراء'),
  Rule(
      imageUrl: '$linkImag/334536891_606462187588982_2238708603771942700_n.jpg',
      title: 'تقاطع طرق مع إشارة قف : تمر السيارة الحمراء ثم الصفراء'),
  Rule(
      imageUrl: '$linkImag/333707688_725136635833906_9211982226214099026_n.jpg',
      title:
          'تقاطع طرق مع إشارة قف : تمر السيارة الحمراء ثم الزرقاء ثم تمر السيارة الصفراء'),
  Rule(
      imageUrl: '$linkImag/333996864_610794514287560_8796357714436617209_n.jpg',
      title: 'السائق لا يستطيع التجاوز :لأن السيارة خلفه تريد تجاوزه'),
  Rule(
      imageUrl: '$linkImag/334282700_204806002158248_7828802716688064234_n.jpg',
      title:
          'تقاطع الطرق مع إشارة ضوئية (أربع أضواء صفراء غمازة ) وإشارات أخرى ،نتبع الإشارات : تمر السيارة الزرقاء ثم الخضراء ثم تمر الحمراء'),
  Rule(
      imageUrl: '$linkImag/333347196_189871553755667_5986061950684787889_n.jpg',
      title: 'عملية التجاوز ممكنة : لأن هناك خط متقطع وأسهم الإتجاه'),
  Rule(
      imageUrl: '$linkImag/333026574_938886853776149_7589755660287095202_n.jpg',
      title:
          'تقاطع طرق مع إشارة ضوئية (أربعة أضواء صفراء غمازة ) الأولوية لليمين ، تمر السيارة الزرقاء ثم تمر  الصفراء'),
  Rule(
      imageUrl: '$linkImag/333385280_772662207523787_4149538466462098047_n.jpg',
      title:
          'تقاطع طرق مع إشارة ترك المرور وإشارة حذار خروج الدرجات من اليسار و إشارة ممر إجباري للدرجات : تمر الدراجة ثم السيارة الصفراء ثم السيارة الحمراء'),
  Rule(
      imageUrl: '$linkImag/333411723_772468127553234_2120508792366124711_n.jpg',
      title:
          'السيارة الزرقاء تستطيع التوقف في الجهتين لأنها في طريق ذو اتجاه واحد'),
  Rule(
      imageUrl: '$linkImag/333267031_2855069811294872_289221559375360852_n.jpg',
      title:
          'السيارة الزرقاء لا تستطيع التوقف في أي من الجهتين : لأن جهة اليمنى غير صالحة للتوقف ولا تستطيع تجاوز الخط المستمر للتوقف في الجهة اليسرى'),
  Rule(
      imageUrl:
          '$linkImag/334249242_1144724176212741_5379783238264937033_n.jpg',
      title:
          'تقاطع طرق مع إشارة حذار محور دوراني و إشارة ترك المرور : تمر السيارتان الصفراء و الخضراء ثم تمر الحمراء'),
];
//kuu

// List<Rule> l1 = rilesData.sublist(0, 14);
// List<Rule> l2 = rilesData.sublist(15, 30);
// List<Rule> l3 = rilesData.sublist(31, 46);
// List<Rule> l4 = rilesData.sublist(47, 63);
// List<Rule> l5 = rilesData.sublist(64, 78);
// List<Rule> l6 = rilesData.sublist(79, 85);

// List<List<Rule>> toteList = [l1, l2, l3, l4, l5, l6];
List<Rule>? sublistRules(int index) {
  switch (index) {
    case 0:
      return rilesData.sublist(0, 14);

    case 1:
      return rilesData.sublist(15, 30);
    case 2:
      return rilesData.sublist(31, 46);
    case 3:
      return rilesData.sublist(47, 63);
    case 4:
      return rilesData.sublist(64, 78);
    case 5:
      return rilesData.sublist(79, 85);
  }
  return null;
}
